[{"name":"Etch","level":0,"school":"T","automation":[],"classes":"Sorcerer, Warlock, Wizard","subclasses":"","casttime":"1 action","range":"Touch","components":{"material":"a vial of acid worth at least 25gp","somatic":false,"verbal":true},"duration":"Instantaneous","ritual":0,"description":"This spell applies a small amount of acid to a nonmagical surface or object made of glass, metal, or stone that you touch, allowing you to produce one of the following effects of your choice:\n• You etch a design into the target, such as a sigil or a small message. The design can cover a 1 foot square of the surface.\n• You corrode and deface the target, such as rusting iron, oxidizing copper, pockmarking stone, or clouding glass.\n• You polish and refine the target, such as creating a mirrored metal surface, a smoothed stone, or crystalclear glass. This effect can also remove corrosion and defacement like rust and pockmarks, including those created by this spell.\nThe effects of this spell are merely superficial, and have no impact on the strength or other properties of the material.","higherlevels":"","concentration":0},{"name":"Sculpt Snow","level":0,"school":"T","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"30 feet","components":{"material":"","somatic":true,"verbal":false},"duration":"Instantaneous","ritual":0,"description":"You choose an area of snow that you can see within range and that fits within a 10-foot cube. You manipulate it in one of the following ways:\n• You instantaneously excavate a cube of snow, move it along the ground, and deposit it up to 10 feet away. This movement doesn't involve enough force to cause damage.\n• You instantaneously mold the snow into a sculpture such as a snowman, or create snow angels across its surface.\n• You cause shapes to appear on the snow, spelling out words, creating images, or shaping patterns. The changes last for 1 hour.\n• You cause the area of snow to become difficult terrain. Alternatively, you can cause the snow to become normal terrain if it is already difficult terrain. This change lasts for 1 hour.\nIf you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.","higherlevels":"","concentration":0},{"name":"Splash","level":0,"school":"C","automation":[],"classes":"Druid, Sorcerer, Warlock, Wizard","subclasses":"","casttime":"1 action","range":"15 feet","components":{"material":"","somatic":true,"verbal":false},"duration":"Instantaneous","ritual":0,"description":"You conjure a blast of water that buffets a Large or smaller creature within range. The target must succeed on a Strength saving throw or take 1d8 bludgeoning damage and be pushed up to 5 feet in a direction of your choice.\nThe spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).","higherlevels":"","concentration":0},{"name":"Stone Fist","level":0,"school":"V","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"5 feet","components":{"material":"","somatic":true,"verbal":false},"duration":"Instantaneous","ritual":0,"description":"Stone coalesces around your fist, which you then smash into a target within range. Make a melee spell attack against the target. On a hit, the target takes 1d6 bludgeoning damage. Additionally, if a target takes this damage and isn't larger than you, it must succeed on a Strength saving throw or be knocked prone.\nThe spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).","higherlevels":"","concentration":0},{"name":"Caustic Pool","level":1,"school":"C","automation":[],"classes":"Druid, Sorcerer, Warlock, Wizard","subclasses":"","casttime":"1 action","range":"30 feet","components":{"material":"a vial of acid worth at least 25gp","somatic":true,"verbal":false},"duration":"1 minute","ritual":0,"description":"Bubbling, multi-colored acid pools across the ground in a 15-foot square starting from a point within range. For the duration, this pool turns the ground in the area into difficult terrain.\nWhen a creature moves into the spell's area for the first time on a turn or starts its turn there, that creature must succeed on a Constitution saving throw or take 3d4 acid damage.","higherlevels":"When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d4, and the square's size increases by 5 feet, for each slot level above 1st.","concentration":0},{"name":"Earthen Disk","level":1,"school":"T","automation":[],"classes":"Druid, Ranger, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"30 feet","components":{"material":"a rock or chunk of earth","somatic":true,"verbal":false},"duration":"Instantaneous","ritual":0,"description":"You raise a small disk of stone from the ground and send it flying at a target of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 2d6 bludgeoning damage and is knocked prone if it is Medium or smaller.","higherlevels":"When you cast this spell using a spell slot of 2nd level or higher, you create one additional disk for each slot level above 1st. You can hurl the disks at one target or at several.","concentration":0},{"name":"Galvanize","level":1,"school":"T","automation":[],"classes":"Wizard","subclasses":"","casttime":"1 minute","range":"Touch","components":{"material":"a vial of acid worth at least 25gp","somatic":false,"verbal":true},"duration":"8 hours","ritual":0,"description":"You touch an object, such as a suit of armor, a shield, or a weapon, and magically protect it from acid and corrosion. For the duration, the object is immune to the destructive effects of corrosive creatures such as rust monsters or oozes, and can't be damaged or destroyed by acid.","higherlevels":"","concentration":0},{"name":"Lightning Rod","level":1,"school":"V","automation":[],"classes":"Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"60 feet","components":{"material":"a 5-foot copper rod worth at least 10gp","somatic":true,"verbal":true},"duration":"Instantaneous","ritual":0,"description":"You electrify the rod used to cast this spell, and send a thin streak of lightning at a target within range. The target must make a Dexterity saving throw, taking 3d8 lightning damage on a failed save, or half as much damage on a successful one. If you are outdoors in stormy conditions or have taken lightning damage in the past minute when you cast this spell, the spell's damage increases by 1d8.","higherlevels":"When you cast this spell using a spell slot of 2nd or higher level, the damage increases by 1d8 for each slot level above 1st.","concentration":0},{"name":"Poison Darts","level":1,"school":"T","automation":[],"classes":"Druid, Ranger, Wizard","subclasses":"","casttime":"1 bonus","range":"Touch","components":{"material":"","somatic":true,"verbal":true},"duration":"1 minute","ritual":0,"description":"You touch one to three darts and transmute them into solid poison. You or someone else can make a ranged spell attack with one of the darts by throwing it or blowing it through a blowgun. If someone else attacks with the dart, that attacker adds your spellcasting ability modifier, not the attacker's, to the attack roll. On a hit, the target takes poison damage equal to 2d6 + your spellcasting ability modifier (instead of the dart's regular damage). Whether the attack hits or misses, the spell then ends on the dart.","higherlevels":"","concentration":0},{"name":"Redirect Missile","level":1,"school":"A","automation":[],"classes":"Druid, Ranger, Sorcerer, Wizard","subclasses":"","casttime":"1 reaction, which you take when you are missed by a ranged weapon attack","range":"60 feet","components":{"material":"","somatic":true,"verbal":false},"duration":"Instantaneous","ritual":0,"description":"You manipulate the airflow around the missile, redirecting it at a target of your choice within range. Make a ranged spell attack. On a hit, the target is effected as if it were hit by the original attack.","higherlevels":"","concentration":0},{"name":"Snowdrift","level":1,"school":"C","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"60 feet","components":{"material":"a snowball","somatic":true,"verbal":false},"duration":"1 minute","ritual":0,"description":"Snow covers the ground in a 20-foot square centered on a point within range and turns it into difficult terrain for the duration.\nWhen the snow appears, each creature standing in its area must succeed on a Constitution saving throw or have its speed reduced to 0 until the end of its next turn. A creature that enters the area or ends its turn there must also make the saving throw.","higherlevels":"","concentration":0},{"name":"Swim","level":1,"school":"T","automation":[],"classes":"Druid, Ranger, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"Touch","components":{"material":"the fin of a fish","somatic":true,"verbal":false},"duration":"1 hour","ritual":0,"description":"You touch a willing creature. The target gains a swimming speed equal to their movement speed for the duration.","higherlevels":"When you cast this spell using a spell slot of 2nd level or higher, you may target one additional creature within range for each slot level above 1st.","concentration":0},{"name":"Water Whip","level":1,"school":"V","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"30 feet","components":{"material":"","somatic":true,"verbal":false},"duration":"Instantaneous","ritual":0,"description":"You wrap your hand in a whip of water and cast it out at a target within range. Make a ranged spell attack against the target. If the attack hits, the creature takes 2d10 bludgeoning damage, and if the creature is Large or smaller, you can push or pull the creature up to 15 feet in a direction of your choice other than upwards. If the target is pulled to within 5 feet of you, you can choose to immediately attempt to grapple it.","higherlevels":"When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d10, and the distance the target is moved increases by 5 feet, for each slot level above 1st.","concentration":0},{"name":"Air Kick","level":2,"school":"V","automation":[],"classes":"Druid, Ranger, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"Self (15-foot line)","components":{"material":"","somatic":true,"verbal":false},"duration":"Instantaneous","ritual":0,"description":"You kick a blast of air 15 feet long and 5 feet wide from you in a direction you choose. Each creature in the line must make a Strength saving throw. On a failed save, a creature takes 2d8 thunder damage and is knocked prone if it is Large or smaller. On a successful save, a creature takes half as much damage and isn't knocked prone. \nThe blast disperses gas or vapor, and it extinguishes candles, torches, and similar unprotected flames in the area.","higherlevels":"When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.","concentration":0},{"name":"Ball Lightning","level":2,"school":"V","automation":[],"classes":"Druid, Sorcerer, Warlock, Wizard","subclasses":"","casttime":"1 action","range":"30 feet","components":{"material":"","somatic":false,"verbal":true},"duration":"1 minute","ritual":0,"description":"A 5-foot-diameter sphere of shimmering lightning appears in an unoccupied space of your choice within range and lasts for the duration. Any creature that starts its turn within 5 feet of the sphere must make a Dexterity saving throw. The creature takes 3d8 lightning damage on a failed save, or half as much damage on a successful one. \nWhen you summon the sphere, choose a direction for it to move. At the start of each of your turns, the sphere moves 10 feet in that direction. As a bonus action, you can choose a new direction for the sphere to move, and it immediately moves 5 feet in that direction. \nThe sphere is ethereal, able to move through objects and barriers, and hovers. The sphere sheds bright blue light in a 30-foot radius and dim light for an additional 30 feet.","higherlevels":"When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.","concentration":1},{"name":"Blasting Bubble","level":2,"school":"V","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"30 feet","components":{"material":"","somatic":true,"verbal":true},"duration":"Instantaneous","ritual":0,"description":"You inflate a roiling bubble of water and send it flying at one creature within range. Make a ranged spell attack against the target. On a hit, the target takes 2d8 bludgeoning damage. Hit or miss, the bubble then explodes. The target and each creature within 10 feet of it must succeed on a Strength saving throw or take 2d8 thunder damage. If one of the creatures around the original target fails the saving throw, they are also pushed 10 feet away from the original target. \nA target immersed in water has disadvantage on the saving throw.","higherlevels":"When you cast this spell using a spell slot of 3rd level or higher, the thunder damage increases by 1d8 for each slot level above 2nd.","concentration":0},{"name":"Blinding Spit","level":2,"school":"V","automation":[],"classes":"Druid, Ranger, Sorcerer, Warlock, Wizard","subclasses":"","casttime":"1 action","range":"15 feet","components":{"material":"","somatic":false,"verbal":true},"duration":"Instantaneous","ritual":0,"description":"You spit a glob of yellow acid into the eyes (or nearest equivalent) of a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 4d4 acid damage and is blinded until the end of its next turn.","higherlevels":"When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 2d4 for each slot level above 2nd.","concentration":0},{"name":"Chilling Breeze","level":2,"school":"V","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"Self (15-foot line)","components":{"material":"a penguin's feather","somatic":true,"verbal":true},"duration":"Up to 1 minute","ritual":0,"description":"You cast forth a gentle breeze of freezing air in a line 15 feet long and 5 feet wide in a direction you choose. Each creature in the line must make a Constitution saving throw. A creature that fails the saving throw takes 1d12 cold damage and is chilled for the spell's duration, as ice freezes their feet to the ground. \nA chilled creature has its speed reduced to 0, and disadvantage on attack rolls. A chilled creature can make a Strength check as an action against your spell save DC, freeing itself on a success. The spell ends if there are no chilled creatures. \nA creature resistant to cold damage has advantage on the saving throw, and a creature immune to cold damage automatically succeeds.","higherlevels":"","concentration":1},{"name":"Earth Launch","level":2,"school":"T","automation":[],"classes":"Druid, Ranger, Sorcerer, Wizard","subclasses":"","casttime":"1 bonus","range":"15 feet","components":{"material":"","somatic":true,"verbal":false},"duration":"Instantaneous","ritual":0,"description":"A small pillar of rock erupts under your feet, launching you into the air. You land on your feet in an unoccupied space of your choice within range, taking no damage from the fall. Large or smaller hostile creatures within 5 feet of you when you land must make a Strength saving throw. On a failed save, the creatures take 1d6 bludgeoning damage and are pushed 5 feet away from you. \nIf you are not standing on the ground when you cast this spell, it has no effect.","higherlevels":"When you cast this spell using a spell slot of 3rd level or higher, the range increases by 15 feet for each slot level above 2nd.","concentration":0},{"name":"Geysers","level":2,"school":"C","automation":[],"classes":"Druid, Ranger, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"30 feet","components":{"material":"a pickaxe","somatic":true,"verbal":true},"duration":"1 minute","ritual":0,"description":"You cause a steaming geyser to momentarily spray from the ground from a point you can see within range. Each creature within 5 feet of the point must succeed on a Dexterity saving throw or take 3d6 fire damage and, if the creature is Large or smaller, be pushed up to 10 feet away from the geyser in a direction of your choice. Being underwater doesn't grant resistance against this damage. \nOn each of your turns until the spell ends, you can use your action to create a new geyser within range.","higherlevels":"When you cast this spell using a spell slot of 3rd level or higher, the fire damage increases by 1d6 for each slot level above 2nd.","concentration":1},{"name":"Redirect Lightning","level":2,"school":"A","automation":[],"classes":"Druid, Ranger, Sorcerer, Wizard","subclasses":"","casttime":"1 reaction, which you take when you or a creature within 5 feet of you takes lightning damage","range":"60 feet","components":{"material":"","somatic":true,"verbal":false},"duration":"Instantaneous","ritual":0,"description":"This spell can redirect some of the lightning cast at you or allies. Roll 2d12 + your spellcasting ability modifier, and reduce the lightning damage by the number rolled. You immediately make a ranged spell attack against a target of your choice within range. On a hit, the new target takes lightning damage equal to the damage prevented.","higherlevels":"","concentration":0},{"name":"Snake Trap","level":2,"school":"I","automation":[],"classes":"Druid, Ranger, Wizard","subclasses":"","casttime":"1 action","range":"5 feet","components":{"material":"a fang of the serpent","somatic":true,"verbal":true},"duration":"1 hour","ritual":0,"description":"You place the image of a small, coiled snake in an unoccupied space within range, acting as a trap. The trap is nearly invisible, requiring a successful Intelligence (Investigation) check against your spell save DC to be discerned. \nThe trap triggers the first time a Small, Medium, or Large creature moves onto the ground or the floor in the trap's space. That creature must succeed on a Dexterity saving throw or be suddenly bitten by the illusory snake, taking 1d12 poison damage and becoming poisoned until the spell ends. On a successful save, the spell ends. \nAt the end of each of its turns, a poisoned target can make a Constitution saving throw. On a success, the spell ends.","higherlevels":"","concentration":0},{"name":"Stone Sap","level":2,"school":"T","automation":[],"classes":"Druid, Ranger, Wizard","subclasses":"","casttime":"1 action","range":"Touch","components":{"material":"a hammer and chisel","somatic":true,"verbal":false},"duration":"1 hour","ritual":0,"description":"You touch a stone object of Large size or smaller or a section of stone no more than 10 feet in any dimension and disrupt its structural integrity. The object or section of stone has vulnerability to bludgeoning and piercing damage for the duration. If the target is reduced to 0 hitpoints or otherwise destroyed, the spell ends.","higherlevels":"","concentration":0},{"name":"Acid Rain","level":3,"school":"V","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"Self (15-foot radius)","components":{"material":"","somatic":true,"verbal":true},"duration":"1 minute","ritual":0,"description":"Droplets of murky acid coalesce and fall from the air in a 15-foot radius around you for the duration. When a creature other than you starts or ends its turn in the area, it must make a Constitution saving throw, taking 4d4 acid damage on a failed save, or half as much damage on a successful one.","higherlevels":"When you cast this spell using a spell slot of 4th level or higher, the damage increases by 2d4 for each slot level above 3rd.","concentration":1},{"name":"Dissolve","level":3,"school":"T","automation":[],"classes":"Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"30 feet","components":{"material":"a vial of acid worth at least 25gp","somatic":true,"verbal":true},"duration":"1 minute","ritual":0,"description":"A target of your choice that you can see within range begins to waste away, their outer layers afflicted with acidic corrosion. The target must make a Constitution saving throw. The target takes 6d4 acid damage on a failed save, or half as much damage on a successful one. On a failed save, the target also begins to dissolve for the spell's duration. At the end of each of its turns, the target repeats the saving throw. It takes 6d4 acid damage on a failed save, and the spell ends on a successful one. \nIf you target a construct or a creature wearing metal armor, it makes the saving throws with disadvantage. \nIf you target an object that isn't being worn or carried, it doesn't make a saving throw and the spell deals maximum damage to it. \nIf you target a nonmagical surface, such as a stone wall or a metal floor, this spell dissolves a 5-foot square of it, and then the spell ends.","higherlevels":"When you cast this spell using a spell slot of 4th level or higher, the initial damage increases by 2d4 for each slot level above 3rd.","concentration":1},{"name":"Ice Spear","level":3,"school":"T","automation":[],"classes":"Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"30 feet","components":{"material":"a drop of water or piece of ice","somatic":true,"verbal":false},"duration":"Instantaneous","ritual":0,"description":"You send a long, spear-like icicle hurtling at a target of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 3d8 cold damage and 3d8 piercing damage. Hit or miss, the spear then explodes into a cloud of frost. The target and each creature within 5 feet of it must succeed on a Constitution saving throw or have its speed reduced to 0 until the end of its next turn.","higherlevels":"When you cast this spell using a spell slot of 4th level or higher, the cold and piercing damage each increase by 1d8 for each slot level above 3rd.","concentration":0},{"name":"Incinerate/Uncinerate","level":3,"school":"T","automation":[],"classes":"Druid, Wizard","subclasses":"","casttime":"1 hour","range":"Touch","components":{"material":"a tinderbox","somatic":true,"verbal":true},"duration":"Special","ritual":1,"description":"You burn and disintegrate one nonmagical object you touch into a pile of magical ashes, specially deconstructed to allow it to later be reconstituted through this same spell. The object must be Small or smaller, and you must hold it throughout the entire casting time of the spell. After casting the spell, the object is reduced to a pile of magical ashes regardless of the material it was made of previously. \nYou can also target a pile of magical ashes made by this spell. Doing so causes the ashes to magically reform into the object that was originally burned, in the same nonmagical state that it was before being incinerated. \nIf a pile of ashes created by this spell are dispersed into wind or water, their magic is lost and the original object with it.","higherlevels":"","concentration":0},{"name":"Whirling Ascent","level":3,"school":"V","automation":[],"classes":"Druid, Ranger, Sorcerer, Wizard","subclasses":"","casttime":"1 bonus","range":"Self","components":{"material":"","somatic":true,"verbal":false},"duration":"Instantaneous","ritual":0,"description":"You leap into the air, creating a blast of air within 15 feet of you. Each creature in the area must make a Strength saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed up to 15 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed. In addition, unsecured objects that are completely within the area of effect are automatically pushed 15 feet away from you by the spell's effect. \nYou gain a flying speed of 60 feet until the end of the turn, as the wind propels you upward. You fall if you end your turn in the air and nothing else is holding you aloft.","higherlevels":"When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.","concentration":0},{"name":"Cold Snap","level":4,"school":"V","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"60 feet","components":{"material":"","somatic":true,"verbal":true},"duration":"1 minute","ritual":0,"description":"Choose a point you can see within range. Frigid air and ice bursts from the point in a 5-foot radius. Each creature in the radius when you cast the spell must make a Constitution saving throw. On a failed save, a creature takes 4d6 cold damage and becomes restrained for the duration, as ice clings to its body. On a successful save, a creature takes half as much damage and is not restrained. \nAt the start of each of a restrained creature's turns, it takes 2d6 cold damage. A restrained creature can make a Strength check against your spell save DC as an action, ending the spell on itself on a success.","higherlevels":"When you cast this spell using a spell slot of 5th level or higher, the initial damage increases by 1d6 for each slot level above 4th.","concentration":1},{"name":"Envenom","level":4,"school":"T","automation":[],"classes":"Druid, Ranger, Warlock, Wizard","subclasses":"","casttime":"1 action","range":"Touch","components":{"material":"","somatic":true,"verbal":true},"duration":"1 hour","ritual":0,"description":"You cause a weapon you touch to seep thick, black poison. Until the spell ends, the first time the wielder hits a creature with the weapon on each of their turns, it deals an additional 2d8 poison damage, and the target must succeed on a Constitution saving throw or be poisoned until the end of their next turn.","higherlevels":"","concentration":1},{"name":"Overpressure Blast","level":4,"school":"V","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"Self (15-foot radius)","components":{"material":"","somatic":true,"verbal":false},"duration":"Instantaneous","ritual":0,"description":"You clap your hands together and a booming wave of sound echoes from you, audible out to 600 feet. Each creature within range, other than you, must make a Constitution saving throw. On a failed save, a creature takes 3d8 thunder damage and is stunned until the end of your next turn. On a successful save, the creature takes half as much damage and isn't stunned.","higherlevels":"When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d8 for each slot level above 4th.","concentration":0},{"name":"Swirling Rubble","level":4,"school":"V","automation":[],"classes":"Druid, Ranger, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"Self (10-foot radius)","components":{"material":"","somatic":true,"verbal":true},"duration":"1 minute","ritual":0,"description":"Clods of dirt and stone raise from the ground and swirl within a 10 foot radius around you for the duration. When a hostile creature enters the area for the first time on a turn or starts its turn there, it takes 1d10 bludgeoning damage. \nYou can use a bonus action on each of your turns to fling a piece of debris at a creature or object within 30 feet of you. When you do so, make a ranged spell attack. On a hit, the target takes 2d10 bludgeoning damage.","higherlevels":"","concentration":1},{"name":"Vortex","level":4,"school":"V","automation":[],"classes":"Druid, Ranger, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"Self (30-foot radius)","components":{"material":"","somatic":true,"verbal":false},"duration":"1 minute","ritual":0,"description":"You draw the air around you into a spiraling vortex of strong wind for the duration, extending to a radius of 30 feet from you. When you cast this spell, you can designate any number of creatures you can see to be unaffected by it. \nEach affected creature that starts its turn in the area must succeed on a Strength saving throw or take 2d8 thunder damage and be pulled up to 15 feet towards you. A flying creature that fails this saving throw is also knocked prone. If this spell pulls a creature to within 5 feet of you, you can use your reaction to make a melee weapon attack against it. \nAny affected creature in the area must spend 2 feet of movement for every 1 foot it moves when moving further from you. \nThe vortex disperses gas or vapor, and it extinguishes candles, torches, and similar unprotected flames in the area. It causes protected flames, such as those of lanterns, to dance wildly and has a 50 percent chance to extinguish them.","higherlevels":"When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d8 for each slot level above 5th.","concentration":1},{"name":"Become Ooze","level":5,"school":"T","automation":[],"classes":"Wizard","subclasses":"","casttime":"1 action","range":"Self","components":{"material":"a sample of ooze jelly","somatic":true,"verbal":true},"duration":"10 minutes","ritual":0,"description":"You adopt a gelatinous, ooze-like form. Until the spell ends, you can't cast spells, and you gain the following benefits:\n• You are amorphous, able to move through a space as narrow as 1 inch wide without squeezing. You can also climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.\n• You have blindsight with a radius of 60 feet.\n• You are immune to the blinded, deafened, exhaustion, frightened, and prone conditions.\n• Your melee attacks deal an extra 3d8 acid damage.ch slot level above 5th.","higherlevels":"","concentration":1},{"name":"Downpour","level":5,"school":"V","automation":[],"classes":"Druid","subclasses":"","casttime":"1 action","range":"Self (60-foot-radius cylinder)","components":{"material":"a vial of water","somatic":true,"verbal":true},"duration":"10 minutes","ritual":0,"description":"A cloud appears in the shape of a cylinder that is 10 feet tall with a 60-foot radius, centered on a point you can see within 300 feet directly above you. The spell fails if you can't see a point in the air where the cloud could appear (for example, if you are in a room that can't accommodate the cloud). The cloud remains above you as you move. \nFreezing rain falls from the cloud, drenching all foes below it. When you cast this spell, you can designate any number of creatures you can see to be unaffected by it. When an affected creature enters the area for the first time on a turn or starts its turn there, it must make a Constitution saving throw. On a failed save, the creature takes 3d12 cold damage and has its speed halved until the start of its next turn. On a successful save, the creature takes half as much damage. \nIf you are outdoors in rainy conditions when you cast this spell, the radius of the cloud is doubled.","higherlevels":"When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d12 for each slot level above 5th.","concentration":1},{"name":"Electric Field","level":5,"school":"V","automation":[],"classes":"Wizard","subclasses":"","casttime":"1 action","range":"60 feet","components":{"material":"a copper rod","somatic":true,"verbal":true},"duration":"1 minute","ritual":0,"description":"The air is filled with sparks and arcing electricity in a 15-foot square starting from a point within range. When a creature moves into the spell's area for the first time on a turn or starts its turn there, that creature must succeed on a Constitution saving throw or take 2d8 lightning damage and be stunned until the start of its next turn. \nA creature resistant to lightning damage has advantage on the saving throw, and a creature immune to lightning damage automatically succeeds.","higherlevels":"When you cast this spell using a spell slot of 6th or higher level, the damage increases by 1d8 for each slot level above 5th.","concentration":1},{"name":"Flame Seeds","level":5,"school":"T","automation":[],"classes":"Druid","subclasses":"","casttime":"1 bonus","range":"Touch","components":{"material":"","somatic":true,"verbal":true},"duration":"1 minute","ritual":0,"description":"You touch one to four acorns, pinecones, walnuts, or other large seeds and imbue them with elemental fire. You or someone else can make a ranged spell attack with one of the seeds by throwing it or hurling it with a sling. If thrown, a seed has a range of 60 feet. If someone else attacks with the seed, that attacker adds your spellcasting ability modifier, not the attacker's, to the attack roll. On a hit, the target takes fire damage equal to 3d8 + your spellcasting ability modifier. Hit or miss, the seed then explodes. The target and each creature within 5 feet of it must succeed on a Dexterity saving throw or take 3d8 fire damage.","higherlevels":"When you cast this spell using a spell slot of 6th level or higher, you can target one additional seed for each slot level above 5th.","concentration":0},{"name":"Melting Blast","level":5,"school":"V","automation":[],"classes":"Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"Self (30-foot line)","components":{"material":"","somatic":true,"verbal":true},"duration":"Instantaneous","ritual":0,"description":"A wave of fuming acid forming a line 30 feet long and 10 feet wide blasts out from you in a direction you choose. Each creature in the line must make a Constitution saving throw. A creature takes 12d4 acid damage on a failed save, or half as much damage on a successful one. If a target fails the save by 5 or more, any armor they are wearing and weapons they are holding are melted and destroyed unless they are magical.\nA creature made of inorganic material such as stone, crystal, or metal has disadvantage on this saving throw. A nonmagical object also takes the damage if it's in the spell's area.","higherlevels":"When you cast this spell using a spell slot of 6th level or higher, the damage increases by 2d4 for each slot level above 5th.","concentration":0},{"name":"Acid Veins","level":6,"school":"T","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"Touch","components":{"material":"a vial of acid worth at least 25gp","somatic":true,"verbal":true},"duration":"1 hour","ritual":0,"description":"You transmute the blood of a willing creature you touch into an acidic compound, which sprays out at attackers. For the duration, whenever the creature is hit with a melee attack, the attacker takes 5d4 acid damage.","higherlevels":"","concentration":1},{"name":"Pyroclastic Flow","level":6,"school":"V","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"Self (60-foot cone)","components":{"material":"a shard of volcanic obsidian","somatic":true,"verbal":true},"duration":"1 minute","ritual":0,"description":"A billowing cloud of superheated ash and lava fills a 60- foot cone emanating from you. Each creature in the area when you cast the spell must make a Constitution saving throw. On a failed save, a creature takes 5d10 fire damage and is blinded for the duration. On a successful save, it takes half as much damage and isn't blinded by this spell. A blinded creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. \nThe ground within the area becomes covered with hot ash and coals for the duration. When a creature moves into or within the area, it takes 2d4 fire damage for every 5 feet it travels. \nThe ash spreads around corners. It ignites flammable objects in the area that aren't being worn or carried. If damage from this spell kills a target, the target is turned to ash.","higherlevels":"When you cast this spell using a spell slot of 7th level or higher, the initial damage increases by 1d10 for each slot level above 6th.","concentration":0},{"name":"Sea Glide","level":6,"school":"T","automation":[],"classes":"Druid","subclasses":"","casttime":"1 minute","range":"30 feet","components":{"material":"a chunk of coral","somatic":false,"verbal":true},"duration":"8 hours","ritual":0,"description":"You and up to ten willing creatures you can see within range assume a liquid form for the duration, appearing as globules of water. While in this liquid form, a creature has a swimming speed of 300 feet, has resistance to damage from nonmagical attacks, and is invisible while underwater. The only actions a creature can take in this form are the Dash action or to revert to its normal form. Reverting takes 1 minute, during which time a creature is incapacitated and can't move. Until the spell ends, a creature can revert to liquid form, which also requires the 1-minute transformation.","higherlevels":"","concentration":0},{"name":"Toxigenate","level":6,"school":"T","automation":[],"classes":"Druid, Wizard","subclasses":"","casttime":"1 action","range":"Touch","components":{"material":"a small vial of troll blood","somatic":true,"verbal":true},"duration":"8 hours","ritual":0,"description":"You imbue a willing creature you touch with a limited ability to heal from otherwise deadly toxins. For the duration, the target is immune to poison damage and the poisoned condition. When the target would have taken poison damage, they instead regain hitpoints equal to half the damage prevented. Once the target has regained hitpoints from this spell a number of times equal to your spellcasting ability modifier, the spell ends. \nIf the target is under the effect of the antiheal spell, that spell's effects are suppressed for the duration of this spell.","higherlevels":"","concentration":0},{"name":"Akhenaten's Warding Tablets","level":7,"school":"V","automation":[],"classes":"Wizard","subclasses":"","casttime":"1 action","range":"Self","components":{"material":"a golden staff adorned with a jackal worth at least 500gp","somatic":true,"verbal":true},"duration":"1 hour","ritual":0,"description":"You create five sandstone tablets carved with hieroglyphs in your space. They float in the air and orbit you for the spell's duration. When you are hit by an attack, you can use your reaction to expend one of the tablets, causing the attack to instead miss you and destroy the tablet. \nWhen you cast the spell and as a bonus action on each of your turns thereafter you can expend one of the tablets, launching it at a target of your choice within 60 feet of you. Make a ranged spell attack against the target. On a hit, the target takes 3d12 bludgeoning damage and is knocked prone. When all the tablets are expended, the spell ends.","higherlevels":"When you cast this spell using a spell slot of 8th level or higher, the number of tablets created increases by one for each slot level above 7th.","concentration":1},{"name":"Antiheal","level":7,"school":"N","automation":[],"classes":"Druid, Warlock, Wizard","subclasses":"","casttime":"1 action","range":"Touch","components":{"material":"","somatic":true,"verbal":false},"duration":"7 days","ritual":0,"description":"You attempt to infect a creature you touch with an insidious poison. The target must make a Constitution saving throw. On a failed saving throw, the target can't regain hitpoints for the duration, and whenever they would regain hitpoints, they instead take poison damage equal to the amount of hitpoints they would have regained. The target regains no hitpoints from completing a long rest (taking no poison damage), and loses all its hit dice for the duration. \nThis spell's effects are subtle, and hidden from detection by the detect poison and disease, detect magic, and identify spells.","higherlevels":"","concentration":0},{"name":"Malec-Keth's Flame Fist","level":7,"school":"V","automation":[],"classes":"Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"Self","components":{"material":"","somatic":true,"verbal":true},"duration":"1 minute","ritual":0,"description":"When you cast this spell, one of your hands is enveloped in searing flame. Make a melee spell attack against a creature within your reach. On a hit, the target takes 8d6 fire damage, and the flame from your hand jumps to the target, surrounding it in an aura of intense heat with a radius of 5 feet. When a creature enters the area for the first time on a turn or starts its turn there, it must make a Constitution saving throw. On a failed save, the creature takes 4d6 fire damage, or half as much damage on a success. These magical flames can't be extinguished by nonmagical means. \nUntil the spell ends, you can make the attack again on each of your turns as an action. \nAlternatively when you make the attack, you can touch an object that isn't being worn or carried, transferring the flame to it and imparting the same aura of intense heat to the target until the spell ends. \nIf damage from this spell kills a target, the target is turned to ash. An affected target sheds bright light in a 20- foot radius and dim light for an additional 20 feet.","higherlevels":"When you cast this spell using a spell slot of 8th level or higher, the attack's damage increases by 1d6 for each slot level above 7th.","concentration":1},{"name":"Sonic Boom","level":7,"school":"V","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"300 feet","components":{"material":"","somatic":true,"verbal":true},"duration":"Instantaneous","ritual":0,"description":"You rocket forward at immense speed at an unoccupied space you can see within range, creating a shockwave in a 15-foot wide line between you and your destination. Each creature in the line excluding you must make a Strength saving throw. On a failed save, a creature takes 6d8 thunder damage, knocked prone, and is stunned until the end of your next turn. On a successful save, the creature takes half as much damage and is knocked prone, but isn't stunned. The shockwave is is audible out to 1 mile. After creating the shockwave, you land at your destination.","higherlevels":"When you cast this spell using a spell slot of 8th level or higher, the damage increases by 1d6 for each slot level above 7th.","concentration":0},{"name":"Frostburn","level":8,"school":"V","automation":[],"classes":"Druid, Sorcerer, Wizard","subclasses":"","casttime":"1 action","range":"120 feet","components":{"material":"a tinderbox and an ice cube","somatic":true,"verbal":true},"duration":"1 minute","ritual":0,"description":"This strange magic entwines hot and cold that envelopes each creature in a 30-foot cube within range. A target must make a Constitution saving throw. On a failed save, it is frostburned for the duration, becoming coated in burning ice. A frostburned creature's speed is halved, and it takes 3d8 cold damage and 3d8 fire damage at the start of each of its turns. A frostburned creature can use its action to make a Dexterity saving throw, ending the spell on itself on a success.","higherlevels":"","concentration":1},{"name":"Absolute Zero","level":9,"school":"T","automation":[],"classes":"Wizard, Sorcerer","subclasses":"","casttime":"1 action","range":"300 feet","components":{"material":"an icecube from the elemental plane of water","somatic":true,"verbal":true},"duration":"1 minute","ritual":0,"description":"You sap even the slightest trace of heat from a 30-foot radius sphere centered on a point you choose within range. All fire in the area is extinguished, and each creature in the area takes 10d8 cold damage. A creature that takes this damage must make a Constitution saving throw. On a failed save, it is completely frozen in place, becoming paralyzed for the duration. \nWhen an affected creature takes fire damage, it can make a Constitution saving throw. On a successful save, the spell ends on the creature. \nA creature killed by this spell becomes a supercooled statue of ice that shatters into dust upon touch.","higherlevels":"","concentration":1},{"name":"Elemental Avatar","level":9,"school":"V","automation":[],"classes":"Druid, Wizard","subclasses":"","casttime":"1 action","range":"Self","components":{"material":"","somatic":true,"verbal":true},"duration":"1 hour","ritual":0,"description":"You have immunity to acid, cold, fire, lightning, and thunder damage for the spell's duration. \nAs a bonus action on each of your turns for the duration, you can unleash an elemental attack against a creature within 30 feet of you. Make a ranged spell attack. On a hit, the target takes 5d12 damage. This damage is your choice of acid, cold, fire, lightning, or thunder damage.","higherlevels":"","concentration":0}]